app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE 1=0  ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG-13', 'PG')  ORDER BY release_date
---
    def index
      @all_ratings = Movie.ratings
      @ratings_to_show = Array.new
      @sort = params[:sort]
      @movies = Movie.all.order(@sort)
      # if !params[:home] and session[:sort]
      #   @sort = session[:sort]
      # end



      if params[:home] and params[:ratings]
        @ratings_to_show = params[:ratings].keys
      elsif !params[:home] and session[:ratings]
        @ratings_to_show = session[:ratings].keys
      end
      @movies = Movie.with_ratings(@ratings_to_show)


      @movies = @movies.order(@sort)

INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Have a good day"], ["rating", "G"], ["release_date", "2022-02-21 00:00:00.000000"], ["created_at", "2022-02-21 20:48:43.624243"], ["updated_at", "2022-02-21 20:48:43.624243"]]
---
    def create
      @movie = Movie.create!(movie_params)